# Electrical Per Phase Data Current Phase B Property

Source: https://www.revitapidocs.com/2026/05ceb2e5-6fae-e77f-70d1-72dfec57ec93.htm

---

| Electrical Per Phase Data Current Phase B Property |
| --- |

The effective value of current on electrical phase B.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double CurrentPhaseB { get; }
```

```
Public ReadOnly Property CurrentPhaseB As Double
	Get
```

```
public:
property double CurrentPhaseB {
	double get ();
}
```

```
member CurrentPhaseB : float with get
```

#### Property Value

Double See Also

#### Reference

ElectricalPerPhaseData Class Autodesk.Revit.DB.Electrical Namespace